require 'csv'

class Inquiry < ApplicationRecord
  #----------------------------------------
  #  ** Includes **
  #----------------------------------------

  #----------------------------------------
  #  ** Constants **
  #----------------------------------------

  #----------------------------------------
  #  ** Enums **
  #----------------------------------------

  #----------------------------------------
  #  ** Validations **
  #----------------------------------------

  #----------------------------------------
  #  ** Associations **
  #----------------------------------------

  # quote
  belongs_to :quote

  #----------------------------------------
  #  ** Delegates **
  #----------------------------------------

  #----------------------------------------
  #  ** Scopes **
  #----------------------------------------

  #----------------------------------------
  #  ** Methods **
  #----------------------------------------

  def self.import(file)
    CSV.parse(file.path, encoding: "SJIS:UTF-8", headers: true) do |row|

    end
    CSV.foreach(file.path, encoding: "SJIS:UTF-8", headers: true) do |row|
      # quote_numberが見つかれば、quoteレコードを呼び出し、見つかれなければ、Inquiry新しく作成
      quote = Quote.find_by(quote_number: row["受付No"]) || new
      # CSVから品目番号を取得して、設定する
    


    end
  end

end
